{
  "name": "Banner",
  "description": "Informs merchants about important changes or persistent conditions. Use this component if you need to communicate to merchants in a prominent way. Banners are placed at the top of the page or section they apply to, and below the page or section header.",
  "bestPractices": "Banners should:\n\n- Be used thoughtfully and sparingly for only the most important information.\n- Not be used to call attention to what a merchant needs to do in the UI instead of making the action clear in the UI itself.\n- Not be the primary entry point to information or actions merchants need on a regular basis.\n- Be dismissible unless they contain critical information or an important step merchants need to take.\n- Use the default icon for `success`, `info`, `warning` and `critical` tones. If the status icon is changed, use only [major icons](https://polaris.shopify.com/design/icons#major-icons-20-20).\n- Remove the status icon only in scenarios where it takes up too much space, such as very small breakpoints or in side navigation cards.\n\n### Placement\n\nBanners should be placed in the appropriate context:\n\n- Banners relevant to an entire page should be placed at the top of that page, below the page header. They should occupy the full width of the content area.\n- Banners related to a section of a page (like a card, popover, or modal) should be placed inside that section, below any section heading. These banners have less spacing and a pared-back design to fit within a content context.\n- Banners related to an element more specific that a section should be placed immediately above or below that element.",
  "keywords": [
    " inform\n  ",
    " update\n  ",
    " changes\n  ",
    " conditions\n  ",
    " dismissible banners\n  ",
    " banner with footer call",
    "to",
    "action\n  ",
    " banner with footer button\n  ",
    " banner with button\n  ",
    " informational banners\n  ",
    " success banners\n  ",
    " warning banners\n  ",
    " critical banners\n  ",
    " banner width\n  ",
    " banner headings\n  ",
    " banner content\n  ",
    " banner buttons\n  ",
    " banner links\n  ",
    " banner body content\n  ",
    " banner text\n  ",
    " banner body text\n  ",
    " full",
    "width alert"
  ],
  "previewImg": "banner.png"
}