{
  "name": "Text",
  "description": "Typography helps establish hierarchy and communicate important content by creating clear visual patterns.",
  "bestPractices": "### Headings\n\nHeadings use all the variants with `heading` in the name, such as `headingMd`. Headings should:\n\n- Clearly describe the section of interface they refer to\n- Highlight the most important concept or piece of information merchants need to know\n- Sit at the top of the section of interface they’re referring to\n\n### Captions\n\nCaptions use the `bodySm` Text variant.\n\n- Use for secondary labels in graphs and charts\n- May be used for timestamps in lists of content\n- Don’t use this variant for other cases\n- Don’t use this variant for text longer than a few words\n- Don’t use this variant for aesthetic effect or to break from the standard text size\n\n### Text styles\n\nText styles should be:\n\n- Used when enhancing the text to help merchants understand its meaning\n- Subdued if the text is less important than its surrounding text\n- Warning if the text denotes something that needs attention, or that merchants need to take action on.\n- Semibold for input fields, or for a row total in a price table\n- Paired with symbols, like an arrow or dollar sign, when using success or critical styles\n\n### Visually hidden\n\nVisually hidden text should:\n\n- Not be used if semantic markup can make content understandable to people using assistive technology\n- Be used to provide extra context when semantic markup isn’t enough\n- Be used on any content that is normally present but is being omitted\n- Make sense in context when used with a screen reader",
  "keywords": [
    " titles\n  ",
    " text\n  ",
    " typographic\n  ",
    " spacing\n  ",
    " display\n  ",
    " heading\n  ",
    " body\n  ",
    " success\n  ",
    " critical\n  ",
    " warning\n  ",
    " subdued\n  ",
    " regular\n  ",
    " medium\n  ",
    " semibold\n  ",
    " bold\n  ",
    " list"
  ],
  "previewImg": "text.png"
}