{
  "name": "ResourceList",
  "description": "A resource list displays a collection of objects of the same type, like products or customers. The main job of a resource list is to help merchants find an object and navigate to a full-page representation of it.",
  "bestPractices": "Resource lists can live in many places in Shopify. You could include a short resource list in a card summarizing recent marketing activities. You could also dedicate an entire page to a resource list like Shopify’s main products list.\n\nResource lists should:\n\n- Have items that perform an action when clicked. The action should navigate to the resource’s details page or otherwise provide more detail about the item.\n- [Customize the content and layout](https://polaris.shopify.com/components/resource-item) of their list items to support merchants’ needs.\n- Support sorting if the list can be long, and especially if different merchant tasks benefit from different sort orders.\n- Support [filtering](https://polaris.shopify.com/components/filters) if the list can be long.\n- Paginate when the current list contains more than 50 items.\n- Use the [skeleton page](https://polaris.shopify.com/components/skeleton-page) component on initial page load for the rest of the page if the loading prop is true and items are processing.\n\nResource lists can optionally:\n\n- Provide bulk actions for tasks that are often applied to many list items at once. For example, merchants may want to add the same tag to a large number of products.",
  "keywords": [
    " ResourceList\n  ",
    " collections\n  ",
    " items\n  ",
    " objects\n  ",
    " list of products\n  ",
    " list of orders\n  ",
    " product lists\n  ",
    " order lists\n  ",
    " collections lists\n  ",
    " collection lists\n  ",
    " list of collections\n  ",
    " product listings list\n  ",
    " channel lists\n  ",
    " resource list attributes\n  ",
    " list attributes\n  ",
    " exceptions list\n  ",
    " list secondary actions\n  ",
    " secondary actions in a list\n  ",
    " list of resources\n  ",
    " filter\n  ",
    " sort"
  ],
  "previewImg": "resource-list.png"
}